<template>
  <div>
    <!-- хедер -->
    <header class="header header-main">
      <div class="header-container" :style="activeSlide">
        <div class="header-container-inner">

          <header-nav-polyana/>

          <div class="header-body">
            <div class="header-body-container general-container">
              <div class="header-content d-flex">
                <!-- Скрываем блок -->
                <div class="header-content__season d-none">
                  <div class="header-content__season-container">
                    <v-btn-toggle active-class="season-active" mandatory
                                  class="header-content__season-switch ma-0 pa-0">
                      <v-btn class="header-content__season-switch-button pa-0 ma-0"
                             elevation="0" min-height="0" min-width="0" value="summer" text>Лето
                      </v-btn>
                      <v-btn class="header-content__season-switch-button pa-0 ma-0"
                             elevation="0" min-height="0" min-width="0" value="winter" text>Зима
                      </v-btn>
                    </v-btn-toggle>
                  </div>
                </div>
                <div class="header-content__title">
                  <h1 class="section-title fontSize-xl--s text-uppercase white--text pa-0">Отдыхайте с комфортом
                    и наслаждайтесь<span class="golden-gradient--text section-title"> красотами
                    Красной Поляны</span> в наших
                    уникальных отелях!
                  </h1>
                </div>
              </div>
              <header-slider class="header-slider--desktop"
                             @changeActiveSlide="changeActiveSlide"/>
            </div>
          </div>
          <header-booking/>
          <header-slider class="header-slider--mobile"
                         @changeActiveSlide="changeActiveSlide"/>
        </div>
      </div>
    </header>

    <!-- рейтинг карточки -->
    <section class="rating">
      <div class="rating-container justify-space-between d-flex">
        <!-- Яндекс -->
        <rating-yandex/>
        <!-- Высокий рейтинг -->
        <rating-tl-rep/>
        <!-- Отели 4-5 звёзд -->
        <rating-we-care/>
        <!-- Удобное бронирование -->
        <rating-booking-comfort/>
        <!-- Актуальное (погода) -->
        <rating-weather/>
      </div>
    </section>

    <!-- пинтерест -->
    <section class="pinterest">
      <v-lazy>
        <div class="pinterest-container">

          <v-card class="pinterest-card" height="485px"
                  elevation="0" color="var(--card-grey)">
            <div class="pinterest-card-container general-container">

              <div class="pinterest-card-head mt-10">
                <h3 class="pinterest-card-title fontSize-xl--s">ДИЗАЙНЕРСКИЕ ОТЕЛИ
                  КАК С КАРТИНОК <span>
                <svg class="pinterest-card-title--pinterest mb-1"
                     xmlns="http://www.w3.org/2000/svg" viewBox="0 0 129 33" fill="none">
                  <g clip-path="url(#clip0_1443_3)">
                    <path
                      d="M29.647 11.4262C31.0457 11.4262 32.3876 10.2688 32.621 8.84086C32.8969 7.451 31.9488 6.29357 30.5512 6.29357C29.1531 6.29357 27.811 7.451 27.5741 8.84086C27.3013 10.2688 28.2105 11.4262 29.647 11.4262ZM124.561 15.5573H127.69C128.118 15.5573 128.37 15.3842 128.466 14.9866C128.616 14.3706 128.77 13.7556 128.928 13.1418C129.021 12.7838 128.811 12.5125 128.412 12.5125H125.324C125.547 11.633 126.413 8.77758 126.413 6.91602C126.413 3.19828 123.237 0.0359822 118.73 0.0359822C113.641 0.0359822 110.33 3.43092 110.33 8.20807C110.33 9.60145 110.853 11.2256 111.501 12.2331C111.222 12.2173 110.943 12.2094 110.663 12.2095C106.796 12.2095 104.361 14.2946 104.361 17.3287C104.361 20.1763 106.619 21.2828 108.745 22.0192C110.634 22.6735 112.373 22.9779 112.373 24.4445C112.373 25.4334 111.416 26.0137 109.543 26.0137C107.321 26.0137 106.1 24.9735 105.789 24.5789C106 24.4145 106.313 24.0231 106.313 23.3708C106.313 22.4585 105.668 21.7138 104.471 21.7138C103.458 21.7138 102.601 22.5352 102.386 23.6157C100.759 24.939 98.9826 25.7965 96.4637 25.7965C93.9834 25.7965 92.696 24.5142 92.696 21.7856C93.2775 21.9615 94.7916 22.1729 95.7923 22.1729C99.9921 22.1729 102.854 20.2762 102.854 16.4778C102.854 14.4353 101.05 12.2902 97.4816 12.2902H97.4735C92.7796 12.2902 90.1504 15.2457 89.0024 18.4965C88.6808 18.4194 88.3586 18.3447 88.0358 18.2723C88.2925 17.5512 88.4769 16.7156 88.4769 15.7891C88.4769 14.1836 87.4766 12.2902 84.7999 12.2902C82.9354 12.2902 81.1669 13.5041 79.9411 15.3234C80.2461 14.1367 80.4483 13.3463 80.4614 13.2933C80.5413 12.9829 80.4112 12.6372 79.9242 12.6372H77.177C76.7855 12.6372 76.5092 12.7747 76.3979 13.2179C76.3232 13.5134 75.3793 17.1947 74.4604 20.7793C73.8816 23.0143 70.8874 25.7965 67.1241 25.7965C64.6434 25.7965 63.3571 24.4298 63.3571 21.7001C64.0062 21.957 65.4525 22.1727 66.4528 22.1727C70.8234 22.1727 73.5148 20.276 73.5148 16.4776C73.5148 14.4351 71.7111 12.29 68.1419 12.29H68.1342C62.8486 12.29 59.6109 16.3706 59.0623 20.9975C58.834 22.9209 57.2009 25.562 55.4304 25.562C54.5679 25.562 54.0869 25.0235 54.0869 24.1093C54.0869 23.3198 54.6461 21.3891 55.259 18.9696C55.4644 18.1602 55.776 16.9255 56.1216 15.5573H58.9951C59.4228 15.5573 59.6737 15.3842 59.7709 14.9866C59.9084 14.414 60.1607 13.4149 60.2323 13.1418C60.3249 12.7838 60.1164 12.5125 59.7159 12.5125H56.8903C56.8903 12.5125 58.1912 7.35298 58.2222 7.22042C58.3474 6.69579 57.9057 6.39304 57.4437 6.48961C57.4437 6.48961 55.2596 6.91457 54.8546 6.99853C54.4474 7.08042 54.1314 7.30273 53.9843 7.88609L52.8276 12.5125H50.5587C50.131 12.5125 49.8794 12.686 49.7835 13.0828C49.6328 13.6987 49.479 14.3137 49.3221 14.9281C49.2283 15.286 49.4378 15.5573 49.8378 15.5573H52.0628C52.047 15.6206 51.2592 18.5997 50.6219 21.2675C50.3219 22.5505 49.3173 25.5525 47.6721 25.5525C46.6893 25.5525 46.274 25.0597 46.274 24.0028C46.274 22.3383 47.9224 18.1716 47.9224 16.2809C47.9224 13.7553 46.5593 12.292 43.7667 12.292C42.0065 12.292 40.1813 13.4218 39.4078 14.4133C39.4078 14.4133 39.6425 13.6017 39.7228 13.2896C39.8085 12.96 39.6306 12.6362 39.1952 12.6362H36.4648C35.8837 12.6362 35.7231 12.9449 35.6378 13.2845C35.6037 13.4207 34.6199 17.2609 33.6754 20.9474C33.0294 23.4717 31.4597 25.5811 29.7814 25.5811C28.9185 25.5811 28.5342 25.0428 28.5342 24.1285C28.5342 23.3386 29.0476 21.3893 29.6603 18.9701C30.4058 16.0247 31.0634 13.5992 31.1337 13.3159C31.2254 12.9528 31.0621 12.6364 30.5913 12.6364H27.8445C27.3469 12.6364 27.1692 12.8959 27.0644 13.2565C27.0644 13.2565 26.2913 16.1655 25.4726 19.4039C24.878 21.7541 24.2215 24.148 24.2215 25.2727C24.2215 27.2799 25.1281 28.7928 27.6207 28.7928C29.5445 28.7928 31.0669 27.8231 32.2295 26.5875C32.0587 27.2563 31.9496 27.6796 31.9386 27.7228C31.8383 28.1052 31.9598 28.4431 32.413 28.4431H35.2238C35.7131 28.4431 35.9012 28.2475 36.0034 27.8233C36.1018 27.4186 38.2011 19.2108 38.2011 19.2108C38.756 17.0059 40.1284 15.546 42.0593 15.546C42.9749 15.546 43.7673 16.1486 43.6756 17.3196C43.5736 18.608 42.0106 23.2362 42.0106 25.2675C42.0106 26.8051 42.5842 28.7942 45.496 28.7942C47.4807 28.7942 48.9418 27.8483 50.0043 26.6276C50.3933 27.9232 51.4239 28.7942 53.3144 28.7942C56.4563 28.7942 58.3501 26.942 59.4627 25.0814C60.386 27.2431 62.5484 28.7932 65.7194 28.7932C68.9514 28.7932 71.4525 27.4389 73.225 25.5978L72.6722 27.753C72.5718 28.1412 72.7417 28.4464 73.2003 28.4464H75.9822C76.3631 28.4464 76.6342 28.2539 76.733 27.8562C76.7819 27.661 77.1839 26.1169 77.7516 23.9228C78.8374 19.7242 80.5825 15.3683 83.2046 15.3683C84.1294 15.3683 84.5087 15.8822 84.5087 16.6918C84.5087 17.0735 84.3971 17.4034 84.3008 17.5802C83.0299 17.3291 82.0074 17.9528 82.0074 19.3017C82.0074 20.1806 82.9377 20.9795 84.1935 20.9795C85.153 20.9795 85.9462 20.7456 86.5789 20.3223C87.2016 20.4499 87.8229 20.5842 88.4427 20.7251C88.3474 21.3339 88.2987 21.949 88.2969 22.5652C88.2969 25.9351 90.7177 28.793 95.0569 28.793C98.4571 28.793 100.791 27.5566 102.805 25.9715C103.773 27.5462 106.218 28.8188 109.425 28.8188C113.821 28.8188 116.314 26.5468 116.314 23.5435C116.314 20.8252 114.069 19.8247 111.754 18.9918C109.872 18.316 108.303 17.9485 108.303 16.6265C108.303 15.5429 109.161 15.0472 110.632 15.0472C111.586 15.0472 112.302 15.2515 112.685 15.3582C113.064 16.3022 113.85 17.3475 115.19 17.3475C116.324 17.3475 116.834 16.4558 116.834 15.6347C116.834 13.2971 112.916 13.052 112.916 8.03871C112.916 4.92129 114.691 2.34959 118.366 2.34959C120.92 2.34959 122.587 3.95928 122.587 6.55723C122.587 8.69921 121.281 12.5123 121.281 12.5123H119.059C118.632 12.5123 118.38 12.6858 118.284 13.0826C118.133 13.6986 117.979 14.3137 117.821 14.9278C117.728 15.2858 117.937 15.5571 118.338 15.5571H120.507C120.507 15.5571 118.265 23.7772 118.265 25.2721C118.265 27.2792 119.402 28.7917 121.896 28.7917C125.423 28.7917 127.627 26.5135 128.585 23.2006C128.66 22.9444 128.514 22.7358 128.253 22.7358H126.907C126.638 22.7358 126.483 22.888 126.415 23.1489C126.111 24.325 125.358 25.5622 123.874 25.5622C123.012 25.5622 122.531 25.0237 122.531 24.1097C122.531 23.32 123.057 21.471 123.704 18.9701C124.012 17.7791 124.561 15.5573 124.561 15.5573ZM96.751 15.4169C97.9982 15.4169 98.5907 16.2416 98.5907 17.2245C98.5907 18.8869 97.2935 19.9006 95.2647 19.9006C94.5386 19.9006 93.5236 19.7296 92.9242 19.5311C93.1762 18.0023 94.2894 15.4169 96.751 15.4169ZM67.4117 15.4169C68.7768 15.4169 69.2508 16.2416 69.2508 17.2245C69.2508 18.8869 67.9542 19.9006 65.9256 19.9006C65.1993 19.9006 64.1843 19.7296 63.5851 19.5311C63.8356 18.0023 64.8228 15.4169 67.4117 15.4169ZM13.4377 0C4.53807 0 0.0507812 6.34237 0.0507812 11.6313C0.0507812 14.8338 1.27054 17.6828 3.88668 18.7442C4.31567 18.9188 4.69992 18.7502 4.82433 18.2781C4.91088 17.9514 5.11559 17.1273 5.20693 16.7838C5.33258 16.3169 5.28369 16.1531 4.93751 15.7461C4.18314 14.8617 3.70111 13.7167 3.70111 12.0948C3.70111 7.38937 7.24284 3.17698 12.9237 3.17698C17.9542 3.17698 20.7176 6.23215 20.7176 10.3124C20.7176 15.681 18.3276 20.2121 14.779 20.2121C12.8194 20.2121 11.3525 18.6011 11.8227 16.6254C12.3857 14.2667 13.4762 11.7211 13.4762 10.0186C13.4762 8.49448 12.6532 7.22332 10.95 7.22332C8.94671 7.22332 7.3375 9.28319 7.3375 12.0427C7.3375 13.8002 7.935 14.9889 7.935 14.9889C7.935 14.9889 5.88494 23.6227 5.52565 25.1348C4.80998 28.1461 5.41788 31.8376 5.46927 32.2105C5.49964 32.4313 5.78529 32.4838 5.91469 32.3172C6.09943 32.0775 8.48506 29.1497 9.29643 26.224C9.5259 25.3956 10.614 21.1062 10.614 21.1062C11.2647 22.3402 13.1669 23.4271 15.1897 23.4271C21.2111 23.4271 25.2966 17.9704 25.2966 10.6664C25.2966 5.14359 20.5905 0 13.4377 0Z"
                      fill="#32343A"/>
                  </g>
                  <defs>
                    <clipPath id="clip0_1443_3">
                      <rect width="129" height="32.4154" fill="white"/>
                    </clipPath>
                  </defs>
                </svg>
              </span>
                </h3>

                <p class="pinterest-card-text">Добро пожаловать в нашу группу отелей на Красной
                  Поляне. Насладитесь шикарными номерами,
                  удивительной кухней, расслабляющим спа-центром и
                  невероятными панорамными видами на
                  окружающие горы. Погрузитесь в атмосферу
                  уюта и природной красоты!
                </p>
              </div>

              <div class="pinterest-card-welcome">
                <watch-dialog link="https://www.youtube.com/embed/igFTm9rzAco?si=CcV-gj-Wqr9eYJ1r">
                  <div class="pinterest-card-welcome-container">
                    <watch class="pinterest-card-welcome-round"/>
                    <pinterest-desktop/>
                    <pinterest-tablet/>
                    <pinterest-mobile/>
                  </div>
                </watch-dialog>
              </div>

            </div>
          </v-card>

        </div>
      </v-lazy>
    </section>

    <!-- Группа отелей -->
    <hotel-group/>

    <!-- Специальные предложения -->
    <special-offers/>

    <!-- Развлекуха летом/зимой-->
    <section class="seasonPrograms">
      <v-lazy>
        <div class="seasonPrograms-container">

          <!-- Летом  -->
          <div class="seasonPrograms-group d-flex justify-space-between">
            <div class="seasonPrograms-summer seasonPrograms-item">
              <div class="seasonPrograms-item-container">
                <div class="seasonPrograms-item-text summer d-flex justify-center align-center rounded-xxl">Летом</div>
              </div>
            </div>
            <!-- Бесплатный трансфер до пляжа -->
            <!--            <season-programs-free-transfer-beach/>-->

            <!-- Живая музыка в баре у бассейна -->
            <season-programs-live-music/>
            <!-- Подогреваемый бассеин -->
            <season-programs-heated-pool-summer/>
            <!-- Спа-комплекс:  место Идеальное для отдыха -->
            <season-programs-spa-complex/>

            <!-- Анимация для детей: веселье и игры -->
            <!--            <season-programs-fun-for-kids/>-->
            <!-- Ещё -->
            <season-programs-show-more-summer/>
          </div>

          <!-- Зимой -->
          <div class="seasonPrograms-group d-flex justify-space-between mt-8">

            <div class="seasonPrograms-winter seasonPrograms-item">
              <div class="seasonPrograms-item-container">
                <div class="seasonPrograms-item-text winter d-flex justify-center align-center">Зимой</div>
              </div>
            </div>
            <!-- бесплатный трансфер до подъёмников -->
            <season-programs-free-transfer-lift/>
            <!-- ski-room хранилище для зимнего спортивного снаряжения -->
            <season-programs-ski-room/>
            <!-- подогреваемый бассеин -->
            <season-programs-heated-pool/>
            <!-- Ещё -->
            <season-programs-show-more-winter/>
          </div>
        </div>
      </v-lazy>
    </section>

    <!-- Эксклюзивная скидка за звонок -->
    <exclusive/>

    <!-- Наши гости делятся своими впечатлениями об отдыхе -->
    <reviews/>

  </div>
</template>
<script lang="ts">
import {Component, Vue} from "vue-property-decorator";

@Component({
  head: {
    title: 'Polyana Group - группа курортных отелей на Красной поляне',
    meta: [
      {
        hid: "description",
        name: "description",
        content: "Polyana Group – группа курортных отелей на Красной поляне, где вы сможете полностью расслабиться и насладиться окружающей природой. Наши отели Ultima club hotel&spa, Country hills resort и Ikos Polyana предлагают широкий спектр услуг, чтобы сделать ваш отдых незабываемым."
      },
      {
        hid: "keywords",
        name: "keywords",
        content: "Ключевые слова для поиска"
      },

      // og:tags
      {
        hid: "og:url",
        property: "og:url",
        content: process.client ? window.location.href : ''
      },
      {
        hid: "og:type",
        property: "og:type",
        content: "website"
      },
      {
        hid: "og:title",
        property: "og:title",
        content: "Polyana Group - группа курортных отелей на Красной поляне"
      },
      {
        hid: "og:description",
        property: "og:description",
        content: "Polyana Group – группа курортных отелей на Красной поляне, где вы сможете полностью расслабиться и насладиться окружающей природой. Наши отели Ultima club hotel&spa, Country hills resort и Ikos Polyana предлагают широкий спектр услуг, чтобы сделать ваш отдых незабываемым."
      },
      {
        hid: "og:image",
        property: "og:image",
        content: "https://ztgxmhicyraofyrgiitp.supabase.co/storage/v1/object/public/publicimg/hotels/Ultima/main/main6.webp"
      },
    ],
  }
})

export default class Pages extends Vue {
  activeImage: string = "https://ztgxmhicyraofyrgiitp.supabase.co/storage/v1/object/public/publicimg/mainbanner/large/MG_7748-_1_.webp"

  get activeSlide() {
    return `background-image: url('${this.activeImage}')`
  }

  changeActiveSlide(value: string) {
    return this.activeImage = value
  }
}
</script>
